a316363723/pr307-308/PR_307_L3_PR_308_L2_lightbody/APP/driver/src/hc32f4a0_dmaaa.c
/**
 *******************************************************************************
 * @file  hc32f4a0_dma.c
 * @brief This file provides firmware functions to manage the Direct Memory
 *        Access (DMA).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-06-12       Zhangxl         First version
   2020-09-04       Chengy          Typo revise in DMA_ReConfigInit()
   2021-10-08       Chengy          Modify based on user manual V1.1
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f4a0_dma.h"
#include "hc32f4a0_utility.h"

/**
 * @addtogroup HC32F4A0_DDL_Driver
 * @{
 */

/**
 * @defgroup DDL_DMA DMA
 * @brief Direct Memory Access Driver Library
 * @{
 */

#if (DDL_DMA_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup DMA_Local_Macros DMA Local Macros
 * @{
 */
#define DMA_CH_REG(reg_base, ch)    (*(uint32_t *)((uint32_t)(&(reg_base)) + ((ch) * 0x40UL)))

/**
 * @defgroup DMA_Check_Parameters_Validity DMA Check Parameters Validity
 * @{
 */
/*! Parameter valid check for DMA unit. */
#define IS_DMA_UNIT(unit)                                                       \
(   ((unit) == M4_DMA1)                     ||                                  \
    ((unit) == M4_DMA2))

/*! Parameter valid check for DMA channel. */
#define IS_DMA_CH(ch)           ((ch) <= DMA_CH7)

/*! Parameter valid check for DMA multiplex channel. */
#define IS_DMA_MX_CH(ch)                                                        \
(   ((ch) != 0x00UL)                        &&                                  \
    (((ch) | DMA_MX_CH_ALL) == DMA_MX_CH_ALL))

/*! Parameter valid check for DMA block size. */
#define IS_DMA_BLKSZ(bc)        ((bc) <= 1024U)

/*! Parameter valid check for DMA non-sequence transfer count. */
#define IS_DMA_NS_TRANSCNT(tc)  ((tc) <= 4096U)

/*! Parameter valid check for DMA non-sequence offset. */
#define IS_DMA_NS_OFFSET(ofs)   ((ofs) <= ((1UL <<20U) - 1UL))

/*! Parameter valid check for DMA LLP pointer address. */
#define IS_DMA_LLP_ADDR(llp)         (((llp) & 0x03UL) == 0x00UL)

/*! Parameter valid check for DMA LLP function. */
#define IS_DMA_LLP_EN(en)                                                       \
(   ((en) == DMA_LLP_ENABLE)                ||                                  \
    ((en) == DMA_LLP_DISABLE))

/*! Parameter valid check for DMA linked-list-pointer mode. */
#define IS_DMA_LLP_MODE(mode)                                                   \
(   ((mode) == DMA_LLP_RUN)                 ||                                  \
    ((mode) == DMA_LLP_WAIT))

/*! Parameter valid check for DMA error interrupt. */
#define IS_DMA_ERR_INT(it)                                                      \
(   ((it) != 0x00000000UL)                  &&                                  \
    (((it) | DMA_ERR_INT_MASK) == DMA_ERR_INT_MASK))

/*! Parameter valid check for DMA transfer interrupt. */
#define IS_DMA_TRANS_INT(it)                                                    \
(   ((it) != 0x00000000UL)                  &&                                  \
    (((it) | DMA_TRANS_INT_MASK) == DMA_TRANS_INT_MASK))

/*! Parameter valid check for DMA request status. */
#define IS_DMA_REQ_STAT(stat)                                                   \
(   ((stat) != 0x00000000UL)                &&                                  \
    (((stat) | DMA_REQ_STAT_MASK) == DMA_REQ_STAT_MASK))

/*! Parameter valid check for DMA channel status. */
#define IS_DMA_TRANS_STAT(stat)                                                 \
(   ((stat) != 0x00000000UL)                &&                                  \
    (((stat) | DMA_TRANS_STAT_MASK) == DMA_TRANS_STAT_MASK))

/*! Parameter valid check for DMA transfer data width. */
#define IS_DMA_DATA_WIDTH(dw)                                                   \
(   ((dw) == DMA_DATAWIDTH_8BIT)            ||                                  \
    ((dw) == DMA_DATAWIDTH_16BIT)           ||                                  \
    ((dw) == DMA_DATAWIDTH_32BIT))

/*! Parameter valid check for DMA source address mode. */
#define IS_DMA_SADDR_MODE(mode)                                                 \
(   ((mode) == DMA_SRC_ADDR_FIX)            ||                                  \
    ((mode) == DMA_SRC_ADDR_INC)            ||                                  \
    ((mode) == DMA_SRC_ADDR_DEC))

/*! Parameter valid check for DMA destination address mode. */
#define IS_DMA_DADDR_MODE(mode)                                                 \
(   ((mode) == DMA_DEST_ADDR_FIX)           ||                                  \
    ((mode) == DMA_DEST_ADDR_INC)           ||                                  \
    ((mode) == DMA_DEST_ADDR_DEC))

/*! Parameter valid check for DMA source address repeat selection. */
#define IS_DMA_SRC_RPT(rpt)                                                     \
(   ((rpt) == DMA_SRC_RPT_ENABLE)           ||                                  \
    ((rpt) == DMA_SRC_RPT_DISABLE))

/*! Parameter valid check for DMA destination address repeat selection. */
#define IS_DMA_DEST_RPT(rpt)                                                    \
(   ((rpt) == DMA_DEST_RPT_ENABLE)          ||                                  \
    ((rpt) == DMA_DEST_RPT_DISABLE))

/*! Parameter valid check for DMA source non-sequence selection. */
#define IS_DMA_SRC_NS(ns)                                                       \
(   ((ns) == DMA_SRC_NS_ENABLE)             ||                                  \
    ((ns) == DMA_SRC_NS_DISABLE))

/*! Parameter valid check for DMA destination non-sequence selection. */
#define IS_DMA_DEST_NS(ns)                                                      \
(   ((ns) == DMA_DEST_NS_ENABLE)            ||                                  \
    ((ns) == DMA_DEST_NS_DISABLE))

/*! Parameter valid check for DMA global interrupt function. */
#define IS_DMA_INT_FUNC(func)                                                   \
(   ((func) == DMA_INT_ENABLE)              ||                                  \
    ((func) == DMA_INT_DISABLE))

