a316363723/pr307-308/PR_307_L3_PR_308_L2_lightbody/APP/driver/src/hc32f4a0_dmaaa.c
    SET_REG32_BIT(DMAx->INTCLR1, u32TransInt);
}

/**
 * @brief  DMA multiplex channel function config.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  M4_DMA1 Unit1.
 *   @arg  M4_DMA2 Unit2.
 * @param  [in] u8MxCh DMA multiplex channel.
 *   @arg  DMA_MX_CH0.
 *   @arg  DMA_MX_CH1.
 *   @arg  DMA_MX_CH2.
 *   @arg  DMA_MX_CH3.
 *   @arg  DMA_MX_CH4.
 *   @arg  DMA_MX_CH5.
 *   @arg  DMA_MX_CH6.
 *   @arg  DMA_MX_CH7.
 *   @arg  DMA_MX_CH_ALL.
 * @param  [in] enNewState The function new state.
 *   @arg  This parameter can be: Enable or Disable.
 * @retval None
 */
void DMA_MxChannelCmd(M4_DMA_TypeDef *DMAx, uint8_t u8MxCh, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_MX_CH(u8MxCh));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (Enable == enNewState)
    {
        WRITE_REG32(DMAx->CHEN, u8MxCh);
    }
    else
    {
        WRITE_REG32(DMAx->CHENCLR, u8MxCh);
    }
}

/**
 * @brief  DMA channel function config.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  M4_DMA1 Unit1.
 *   @arg  M4_DMA2 Unit2.
 * @param  [in] u8Ch DMA channel.
 *   @arg  DMA_CH0.
 *   @arg  DMA_CH1.
 *   @arg  DMA_CH2.
 *   @arg  DMA_CH3.
 *   @arg  DMA_CH4.
 *   @arg  DMA_CH5.
 *   @arg  DMA_CH6.
 *   @arg  DMA_CH7.
 * @param  [in] enNewState The function new state.
 *   @arg  This parameter can be: Enable or Disable.
 * @retval None
 */
void DMA_ChannelCmd(M4_DMA_TypeDef *DMAx, uint8_t u8Ch, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_CH(u8Ch));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (Enable == enNewState)
    {
        WRITE_REG32(DMAx->CHEN, ((1UL << u8Ch) & 0xFFUL));
    }
    else
    {
        WRITE_REG32(DMAx->CHENCLR, ((1UL << u8Ch) & 0xFFUL));
    }
}

/**
 * @brief  Get DMA request status.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  M4_DMA1 Unit1.
 *   @arg  M4_DMA2 Unit2.
 * @param  [in] u32Status DMA request status.
 *   @arg  DMA_REQ_CH0.
 *   @arg  DMA_REQ_CH1.
 *   @arg  DMA_REQ_CH2.
 *   @arg  DMA_REQ_CH3.
 *   @arg  DMA_REQ_CH4.
 *   @arg  DMA_REQ_CH5.
 *   @arg  DMA_REQ_CH6.
 *   @arg  DMA_REQ_CH7.
 *   @arg  DMA_REQ_RECONFIG.
 * @retval en_flag_status_t
 */
en_flag_status_t DMA_GetReqStatus(const M4_DMA_TypeDef *DMAx, uint32_t u32Status)
{
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_REQ_STAT(u32Status));

    return (READ_REG32_BIT(DMAx->REQSTAT, u32Status) ? Set : Reset);
}

/**
 * @brief  Get DMA transfer status.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  M4_DMA1 Unit1.
 *   @arg  M4_DMA2 Unit2.
 * @param  [in] u32Status DMA transfer status.
 *   @arg  DMA_TRANS_CH0.
 *   @arg  DMA_TRANS_CH1.
 *   @arg  DMA_TRANS_CH2.
 *   @arg  DMA_TRANS_CH3.
 *   @arg  DMA_TRANS_CH4.
 *   @arg  DMA_TRANS_CH5.
 *   @arg  DMA_TRANS_CH6.
 *   @arg  DMA_TRANS_CH7.
 *   @arg  DMA_TRANS_RECONFIG.
 *   @arg  DMA_TRANS_DMA.
 * @retval en_flag_status_t
 */
en_flag_status_t DMA_GetTransStatus(const M4_DMA_TypeDef *DMAx, uint32_t u32Status)
{
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_TRANS_STAT(u32Status));

    return (READ_REG32_BIT(DMAx->CHSTAT, u32Status) ? Set : Reset);
}

/**
 * @brief  DMA re-config mode trigger source.
 * @param  [in] enSrc DMA transfer trigger source.
 *   @arg  This parameter can be @ref en_event_src_t
 * @retval None
 * @note This register belongs to AOS module, please ensure enable it in advance.
 *       DMA1 and DMA2 share this register.
 */
void DMA_SetReConfigTriggerSrc(en_event_src_t enSrc)
{
    MODIFY_REG32(M4_AOS->DMA_TRGSELRC, AOS_DMA_TRGSELRC_TRGSEL, enSrc);
}

/**
 * @brief  AOS common trigger function config for DMA re-config mode.
 * @param  [in] u32ComTrig Common trigger event enable.
 *         This parameter can be one of the following values:
 *           @arg  DMA_COM_TRIG1: Common trigger event 1 .
 *           @arg  DMA_COM_TRIG2: Common trigger event 2.
 * @param  [in] enNewState New state of common trigger function.
 * @retval None
 * @note This register belongs to AOS module, please ensure enable it in advance.
 */
void DMA_RCComTriggerCmd(uint32_t u32ComTrig, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    DDL_ASSERT(IS_DMA_COM_TRIG(u32ComTrig));

    if (Enable == enNewState)
    {
        SET_REG32_BIT(M4_AOS->DMA_TRGSELRC, u32ComTrig);
    }
    else
    {
        CLEAR_REG32_BIT(M4_AOS->DMA_TRGSELRC, u32ComTrig);
    }
}

/**
 * @brief  Config DMA transfer trigger source.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  M4_DMA1 Unit1.
 *   @arg  M4_DMA2 Unit2.
 * @param  [in] u8Ch DMA channel.
 *   @arg  DMA_CH0.
 *   @arg  DMA_CH1.
 *   @arg  DMA_CH2.
 *   @arg  DMA_CH3.
 *   @arg  DMA_CH4.
 *   @arg  DMA_CH5.
 *   @arg  DMA_CH6.
 *   @arg  DMA_CH7.
 * @param  [in] enSrc DMA transfer trigger source.
 *   @arg  This parameter can be @ref en_event_src_t
 * @retval None
 * @note This register belongs to AOS module, please ensure enable it in advance.
 */
void DMA_SetTriggerSrc(const M4_DMA_TypeDef *DMAx, uint8_t u8Ch, en_event_src_t enSrc)
{
    __IO uint32_t *TRGSELx;

    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_CH(u8Ch));

    if (M4_DMA1 == DMAx)
    {
        TRGSELx = (uint32_t *)((uint32_t)(&M4_AOS->DMA1_TRGSEL0) + u8Ch*4UL);
    }
    else
    {
        TRGSELx = (uint32_t *)((uint32_t)(&M4_AOS->DMA2_TRGSEL0) + u8Ch*4UL);
    }
    MODIFY_REG32(*TRGSELx, AOS_DMA1_TRGSEL_TRGSEL, enSrc);
}

/**
 * @brief  AOS common trigger function config for DMA
 * @param  [in] DMAx DMA unit instance.
 *   @arg  M4_DMA1 Unit1.
 *   @arg  M4_DMA2 Unit2.
 * @param  [in] u8Ch DMA channel.
 *   @arg  DMA_CH0.
 *   @arg  DMA_CH1.
 *   @arg  DMA_CH2.
 *   @arg  DMA_CH3.
 *   @arg  DMA_CH4.
 *   @arg  DMA_CH5.
 *   @arg  DMA_CH6.
 *   @arg  DMA_CH7.
 * @param  [in] u32ComTrig Common trigger event enable.
 *         This parameter can be one of the following values:
 *           @arg  DMA_COM_TRIG1: Common trigger event 1 .
 *           @arg  DMA_COM_TRIG2: Common trigger event 2.
 * @param  [in] enNewState New state of common trigger function.
 * @retval None
 * @note This register belongs to AOS module, please ensure enable it in advance.
 */
void DMA_ComTriggerCmd(const M4_DMA_TypeDef *DMAx, uint8_t u8Ch, uint32_t u32ComTrig, en_functional_state_t enNewState)
{
    __IO uint32_t *TRGSELx;

