a316363723/pr307-308/PR_307_L3_PR_308_L2_lightbody/APP/driver/src/hc32f4a0_dmaaa.c
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_CH(u8Ch));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    DDL_ASSERT(IS_DMA_COM_TRIG(u32ComTrig));

    if (M4_DMA1 == DMAx)
    {
        TRGSELx = (uint32_t *)((uint32_t)(&M4_AOS->DMA1_TRGSEL0) + u8Ch*4UL);
    }
    else
    {
        TRGSELx = (uint32_t *)((uint32_t)(&M4_AOS->DMA2_TRGSEL0) + u8Ch*4UL);
    }

    if (Enable == enNewState)
    {
        SET_REG32_BIT(*TRGSELx, u32ComTrig);
    }
    else
    {
        CLEAR_REG32_BIT(*TRGSELx, u32ComTrig);
    }
}

/**
 * @brief  Config DMA source address.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  M4_DMA1 Unit1.
 *   @arg  M4_DMA2 Unit2.
 * @param  [in] u8Ch DMA channel.
 *   @arg  DMA_CH0.
 *   @arg  DMA_CH1.
 *   @arg  DMA_CH2.
 *   @arg  DMA_CH3.
 *   @arg  DMA_CH4.
 *   @arg  DMA_CH5.
 *   @arg  DMA_CH6.
 *   @arg  DMA_CH7.
 * @param  [in] u32Addr DMA source address.
 * @retval None
 */
void DMA_SetSrcAddr(M4_DMA_TypeDef *DMAx, uint8_t u8Ch, uint32_t u32Addr)
{
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_CH(u8Ch));

    WRITE_REG32(DMA_CH_REG(DMAx->SAR0, u8Ch), u32Addr);
}

/**
 * @brief  Config DMA destination address.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  M4_DMA1 Unit1.
 *   @arg  M4_DMA2 Unit2.
 * @param  [in] u8Ch DMA channel.
 *   @arg  DMA_CH0.
 *   @arg  DMA_CH1.
 *   @arg  DMA_CH2.
 *   @arg  DMA_CH3.
 *   @arg  DMA_CH4.
 *   @arg  DMA_CH5.
 *   @arg  DMA_CH6.
 *   @arg  DMA_CH7.
 * @param  [in] u32Addr DMA destination address.
 * @retval None
 */
void DMA_SetDestAddr(M4_DMA_TypeDef *DMAx, uint8_t u8Ch, uint32_t u32Addr)
{
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_CH(u8Ch));

    WRITE_REG32(DMA_CH_REG(DMAx->DAR0, u8Ch), u32Addr);
}

/**
 * @brief  Config DMA transfer count.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  M4_DMA1 Unit1.
 *   @arg  M4_DMA2 Unit2.
 * @param  [in] u8Ch DMA channel.
 *   @arg  DMA_CH0.
 *   @arg  DMA_CH1.
 *   @arg  DMA_CH2.
 *   @arg  DMA_CH3.
 *   @arg  DMA_CH4.
 *   @arg  DMA_CH5.
 *   @arg  DMA_CH6.
 *   @arg  DMA_CH7.
 * @param  [in] u16Cnt DMA transfer count (0: infinite, 1 ~ 65535).
 * @retval None
 */
void DMA_SetTransCnt(M4_DMA_TypeDef *DMAx, uint8_t u8Ch, uint16_t u16Cnt)
{
    __IO uint32_t *DTCTLx;
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_CH(u8Ch));

    DTCTLx = &DMA_CH_REG(DMAx->DTCTL0, u8Ch);
    MODIFY_REG32(*DTCTLx, DMA_DTCTL_CNT, ((uint32_t)(u16Cnt) << DMA_DTCTL_CNT_POS));
}

/**
 * @brief  Config DMA block size per transfer.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  M4_DMA1 Unit1.
 *   @arg  M4_DMA2 Unit2.
 * @param  [in] u8Ch DMA channel.
 *   @arg  DMA_CH0.
 *   @arg  DMA_CH1.
 *   @arg  DMA_CH2.
 *   @arg  DMA_CH3.
 *   @arg  DMA_CH4.
 *   @arg  DMA_CH5.
 *   @arg  DMA_CH6.
 *   @arg  DMA_CH7.
 * @param  [in] u16Size DMA block size (0, 1024: 1024, 1 ~ 1023).
 * @retval None
 */
void DMA_SetBlockSize(M4_DMA_TypeDef *DMAx, uint8_t u8Ch, uint16_t u16Size)
{
    __IO uint32_t *DTCTLx;
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_CH(u8Ch));
    DDL_ASSERT(IS_DMA_BLKSZ(u16Size));

    DTCTLx = &DMA_CH_REG(DMAx->DTCTL0, u8Ch);
    MODIFY_REG32(*DTCTLx, DMA_DTCTL_BLKSIZE, ((uint32_t)u16Size << DMA_DTCTL_BLKSIZE_POS));
}

/**
 * @brief  Config DMA source repeat size.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  M4_DMA1 Unit1.
 *   @arg  M4_DMA2 Unit2.
 * @param  [in] u8Ch DMA channel.
 *   @arg  DMA_CH0.
 *   @arg  DMA_CH1.
 *   @arg  DMA_CH2.
 *   @arg  DMA_CH3.
 *   @arg  DMA_CH4.
 *   @arg  DMA_CH5.
 *   @arg  DMA_CH6.
 *   @arg  DMA_CH7.
 * @param  [in] u16Size DMA source repeat size (0, 1024: 1024, 1 ~ 1023).
 * @retval None
 */
void DMA_SetSrcRptSize(M4_DMA_TypeDef *DMAx, uint8_t u8Ch, uint16_t u16Size)
{
    __IO uint32_t *RPTx;
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_CH(u8Ch));
    DDL_ASSERT(IS_DMA_BLKSZ(u16Size));

    RPTx = &DMA_CH_REG(DMAx->RPT0, u8Ch);
    MODIFY_REG32(*RPTx, DMA_RPT_SRPT, ((uint32_t)(u16Size) << DMA_RPT_SRPT_POS));
}

/**
 * @brief  Config DMA destination repeat size.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  M4_DMA1 Unit1.
 *   @arg  M4_DMA2 Unit2.
 * @param  [in] u8Ch DMA channel.
 *   @arg  DMA_CH0.
 *   @arg  DMA_CH1.
 *   @arg  DMA_CH2.
 *   @arg  DMA_CH3.
 *   @arg  DMA_CH4.
 *   @arg  DMA_CH5.
 *   @arg  DMA_CH6.
 *   @arg  DMA_CH7.
 * @param  [in] u16Size DMA destination repeat size (0, 1024: 1024, 1 ~ 1023).
 * @retval None
 */
void DMA_SetDestRptSize(M4_DMA_TypeDef *DMAx, uint8_t u8Ch, uint16_t u16Size)
{
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_CH(u8Ch));
    DDL_ASSERT(IS_DMA_BLKSZ(u16Size));

    MODIFY_REG32(DMA_CH_REG(DMAx->RPT0, u8Ch), DMA_RPT_DRPT, ((uint32_t)(u16Size) << DMA_RPT_DRPT_POS));
}

/**
 * @brief  Config DMA source transfter count under non-sequence mode.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  M4_DMA1 Unit1.
 *   @arg  M4_DMA2 Unit2.
 * @param  [in] u8Ch DMA channel.
 *   @arg  DMA_CH0.
 *   @arg  DMA_CH1.
 *   @arg  DMA_CH2.
 *   @arg  DMA_CH3.
 *   @arg  DMA_CH4.
 *   @arg  DMA_CH5.
 *   @arg  DMA_CH6.
 *   @arg  DMA_CH7.
 * @param  [in] u32Cnt DMA source transfer count (0, 4096: 4096, 1 ~ 4095).
 * @retval None
 */
void DMA_SetNonSeqSrcCnt(M4_DMA_TypeDef *DMAx, uint8_t u8Ch, uint32_t u32Cnt)
{
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_CH(u8Ch));
    DDL_ASSERT(IS_DMA_NS_TRANSCNT(u32Cnt));

    MODIFY_REG32(DMA_CH_REG(DMAx->SNSEQCTL0, u8Ch), DMA_SNSEQCTLB_SNSCNTB, (u32Cnt << DMA_SNSEQCTLB_SNSCNTB_POS));
}

/**
 * @brief  Config DMA destination transfter count under non-sequence mode.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  M4_DMA1 Unit1.
 *   @arg  M4_DMA2 Unit2.
 * @param  [in] u8Ch DMA channel.
 *   @arg  DMA_CH0.
 *   @arg  DMA_CH1.
 *   @arg  DMA_CH2.
 *   @arg  DMA_CH3.
 *   @arg  DMA_CH4.
 *   @arg  DMA_CH5.
 *   @arg  DMA_CH6.
 *   @arg  DMA_CH7.
 * @param  [in] u32Cnt DMA destination transfer count (0, 4096: 4096, 1 ~ 4095).
 * @retval None
 */
void DMA_SetNonSeqDestCnt(M4_DMA_TypeDef *DMAx, uint8_t u8Ch, uint32_t u32Cnt)
{
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_CH(u8Ch));
    DDL_ASSERT(IS_DMA_NS_TRANSCNT(u32Cnt));

    MODIFY_REG32(DMA_CH_REG(DMAx->DNSEQCTL0, u8Ch), DMA_DNSEQCTL_DNSCNT, (u32Cnt << DMA_DNSEQCTL_DNSCNT_POS));
}

/**
 * @brief  Config DMA source offset number under non-sequence mode.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  M4_DMA1 Unit1.
 *   @arg  M4_DMA2 Unit2.
 * @param  [in] u8Ch DMA channel.
 *   @arg  DMA_CH0.
 *   @arg  DMA_CH1.
 *   @arg  DMA_CH2.
 *   @arg  DMA_CH3.
 *   @arg  DMA_CH4.
 *   @arg  DMA_CH5.
 *   @arg  DMA_CH6.
 *   @arg  DMA_CH7.
 * @param  [in] u32Ofs DMA source offset (0 ~ 2^20 - 1).
 * @retval None
 */
void DMA_SetNonSeqSrcOffset(M4_DMA_TypeDef *DMAx, uint8_t u8Ch, uint32_t u32Ofs)
{
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_CH(u8Ch));
    DDL_ASSERT(IS_DMA_NS_OFFSET(u32Ofs));

    MODIFY_REG32(DMA_CH_REG(DMAx->SNSEQCTL0, u8Ch), DMA_SNSEQCTL_SOFFSET, u32Ofs);
}

/**
 * @brief  Config DMA destination offset number under non-sequence mode.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  M4_DMA1 Unit1.
 *   @arg  M4_DMA2 Unit2.
 * @param  [in] u8Ch DMA channel.
 *   @arg  DMA_CH0.
 *   @arg  DMA_CH1.
 *   @arg  DMA_CH2.
 *   @arg  DMA_CH3.
 *   @arg  DMA_CH4.
 *   @arg  DMA_CH5.
 *   @arg  DMA_CH6.
 *   @arg  DMA_CH7.
 * @param  [in] u32Ofs DMA destination offset (0 ~ 2^20 - 1).
 * @retval None
 */
void DMA_SetNonSeqDestOffset(M4_DMA_TypeDef *DMAx, uint8_t u8Ch, uint32_t u32Ofs)
{
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_CH(u8Ch));
    DDL_ASSERT(IS_DMA_NS_OFFSET(u32Ofs));

    MODIFY_REG32(DMA_CH_REG(DMAx->DNSEQCTL0, u8Ch), DMA_DNSEQCTL_DOFFSET, u32Ofs);
}

/**
 * @brief  Initialize DMA config structure. Fill each pstcDmaInit with default value
 * @param  [in] pstcDmaInit Pointer to a stc_dma_init_t structure that
 *                            contains configuration information.
 * @retval Ok: DMA structure initialize successful
 *         ErrorInvalidParameter: NULL pointer
 */
en_result_t DMA_StructInit(stc_dma_init_t *pstcDmaInit)
{
    en_result_t enRet = Ok;

