a316363723/pr307-308/PR_307_L3_PR_308_L2_lightbody/APP/driver/src/hc32f4a0_dmaaa.c
    if (NULL == pstcDmaNonSeqInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        pstcDmaNonSeqInit->u32SrcNonSeqEn   = DMA_SRC_NS_DISABLE;
        pstcDmaNonSeqInit->u32SrcNonSeqCnt  = 0x00UL;
        pstcDmaNonSeqInit->u32SrcNonSeqOfs  = 0x00UL;
        pstcDmaNonSeqInit->u32DestNonSeqEn  = DMA_DEST_NS_DISABLE;
        pstcDmaNonSeqInit->u32DestNonSeqCnt = 0x00UL;
        pstcDmaNonSeqInit->u32DestNonSeqOfs = 0x00UL;
    }
    return enRet;
}

/**
 * @brief  DMA non-sequence mode initialize.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  M4_DMA1 Unit1.
 *   @arg  M4_DMA2 Unit2.
 * @param  [in] u8Ch DMA channel.
 *   @arg  DMA_CH0.
 *   @arg  DMA_CH1.
 *   @arg  DMA_CH2.
 *   @arg  DMA_CH3.
 *   @arg  DMA_CH4.
 *   @arg  DMA_CH5.
 *   @arg  DMA_CH6.
 *   @arg  DMA_CH7.
 * @param  [in] pstcDmaNonSeqInit DMA non-sequence mode config structure.
 *   @arg  u32SrcNonSeqEn   DMA source non-sequence enable or disable.
 *   @arg  u32SrcNonSeqCnt  DMA source non-sequence count.
 *   @arg  u32SrcNonSeqOfs  DMA source non-sequence offset.
 *   @arg  u32DestNonSeqEn  DMA destination non-sequence enable or disable.
 *   @arg  u32DestNonSeqCnt DMA destination non-sequence count.
 *   @arg  u32DestNonSeqOfs DMA destination non-sequence offset.
 * @retval Ok: DMA non-sequence function initialize successful
 *         ErrorInvalidParameter: NULL pointer
 * @note Call this function after DMA_Init();
 */
en_result_t DMA_NonSeqInit(M4_DMA_TypeDef *DMAx, uint8_t u8Ch, const stc_dma_nonseq_init_t *pstcDmaNonSeqInit)
{
    en_result_t enRet = Ok;
    __IO uint32_t *CHCTLx;

    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_CH(u8Ch));

    if (NULL == pstcDmaNonSeqInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        DDL_ASSERT(IS_DMA_SRC_NS(pstcDmaNonSeqInit->u32SrcNonSeqEn));
        DDL_ASSERT(IS_DMA_DEST_NS(pstcDmaNonSeqInit->u32DestNonSeqEn));
        DDL_ASSERT(IS_DMA_NS_TRANSCNT(pstcDmaNonSeqInit->u32SrcNonSeqCnt));
        DDL_ASSERT(IS_DMA_NS_TRANSCNT(pstcDmaNonSeqInit->u32DestNonSeqCnt));
        DDL_ASSERT(IS_DMA_NS_OFFSET(pstcDmaNonSeqInit->u32SrcNonSeqOfs));
        DDL_ASSERT(IS_DMA_NS_OFFSET(pstcDmaNonSeqInit->u32DestNonSeqOfs));

        CHCTLx = &DMA_CH_REG(DMAx->CHCTL0, u8Ch);
        MODIFY_REG32(*CHCTLx,                                                   \
            (DMA_CHCTL_SNSEQEN | DMA_CHCTL_DNSEQEN),                            \
            (pstcDmaNonSeqInit->u32SrcNonSeqEn | pstcDmaNonSeqInit->u32DestNonSeqEn));

        WRITE_REG32(DMA_CH_REG(DMAx->SNSEQCTL0, u8Ch),                          \
            ((pstcDmaNonSeqInit->u32SrcNonSeqCnt << DMA_SNSEQCTL_SNSCNT_POS) |  \
            pstcDmaNonSeqInit->u32SrcNonSeqOfs));
        
        WRITE_REG32(DMA_CH_REG(DMAx->DNSEQCTL0, u8Ch),                          \
            ((pstcDmaNonSeqInit->u32DestNonSeqCnt << DMA_DNSEQCTL_DNSCNT_POS) |  \
            pstcDmaNonSeqInit->u32DestNonSeqOfs));
    }
    return enRet;
}

/**
 * @brief  Initialize DMA Linked List Pointer (hereafter, LLP) mode config structure.
 *          Fill each pstcDmaInit with default value
 * @param  [in] pstcDmaLlpInit Pointer to a stc_dma_llp_init_t structure that
 *                            contains configuration information.
 * @retval Ok: DMA LLP mode config structure initialize successful
 *         ErrorInvalidParameter: NULL pointer
 */
en_result_t DMA_LlpStructInit(stc_dma_llp_init_t *pstcDmaLlpInit)
{
    en_result_t enRet = Ok;

    if (NULL == pstcDmaLlpInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        pstcDmaLlpInit->u32LlpEn    = DMA_LLP_DISABLE;
        pstcDmaLlpInit->u32LlpRun   = DMA_LLP_WAIT;
        pstcDmaLlpInit->u32LlpAddr  = 0x00UL;
    }
    return enRet;
}

/**
 * @brief  DMA LLP mode initialize.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  M4_DMA1 Unit1.
 *   @arg  M4_DMA2 Unit2.
 * @param  [in] u8Ch DMA channel.
 *   @arg  DMA_CH0.
 *   @arg  DMA_CH1.
 *   @arg  DMA_CH2.
 *   @arg  DMA_CH3.
 *   @arg  DMA_CH4.
 *   @arg  DMA_CH5.
 *   @arg  DMA_CH6.
 *   @arg  DMA_CH7.
 * @param  [in] pstcDmaLlpInit DMA LLP config structure.
 *   @arg  u32LlpEn         DMA LLP enable or disable.
 *   @arg  u32LlpRun        DMA LLP auto-run or wait request.
 *   @arg  u32LlpAddr       DMA LLP next list pointer address.
 * @retval Ok: DMA LLP function initialize successful
 *         ErrorInvalidParameter: NULL pointer
 * @note Call this function after DMA_Init();
 */
en_result_t DMA_LlpInit(M4_DMA_TypeDef *DMAx, uint8_t u8Ch, const stc_dma_llp_init_t *pstcDmaLlpInit)
{
    en_result_t enRet = Ok;
    __IO uint32_t *CHCTLx;

    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_CH(u8Ch));

    if (NULL == pstcDmaLlpInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        DDL_ASSERT(IS_DMA_LLP_EN(pstcDmaLlpInit->u32LlpEn));
        DDL_ASSERT(IS_DMA_LLP_ADDR(pstcDmaLlpInit->u32LlpAddr));
        DDL_ASSERT(IS_DMA_LLP_MODE(pstcDmaLlpInit->u32LlpRun));

        CHCTLx = &DMA_CH_REG(DMAx->CHCTL0, u8Ch);
        MODIFY_REG32(*CHCTLx,                                                   \
            (DMA_CHCTL_LLPEN | DMA_CHCTL_LLPRUN),                               \
            (pstcDmaLlpInit->u32LlpEn | pstcDmaLlpInit->u32LlpRun));

        WRITE_REG32(DMA_CH_REG(DMAx->LLP0, u8Ch), pstcDmaLlpInit->u32LlpAddr);
    }

    return enRet;
}

/**
 * @brief  Config DMA LLP value.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  M4_DMA1 Unit1.
 *   @arg  M4_DMA2 Unit2.
 * @param  [in] u8Ch DMA channel.
 *   @arg  DMA_CH0.
 *   @arg  DMA_CH1.
 *   @arg  DMA_CH2.
 *   @arg  DMA_CH3.
 *   @arg  DMA_CH4.
 *   @arg  DMA_CH5.
 *   @arg  DMA_CH6.
 *   @arg  DMA_CH7.
 * @param  [in] u32LlpAddr Next link pointer address for DMA LLP mode.
 * @retval None
 */
void DMA_SetLlpAddr(M4_DMA_TypeDef *DMAx, uint8_t u8Ch, uint32_t u32LlpAddr)
{
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_CH(u8Ch));
    DDL_ASSERT(IS_DMA_LLP_ADDR(u32LlpAddr));

    WRITE_REG32(DMA_CH_REG(DMAx->LLP0, u8Ch), (u32LlpAddr & 0xFFFFFFFCUL));
}

/**
 * @brief  DMA LLP enable or disable.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  M4_DMA1 Unit1.
 *   @arg  M4_DMA2 Unit2.
 * @param  [in] u8Ch DMA channel.
 *   @arg  DMA_CH0.
 *   @arg  DMA_CH1.
 *   @arg  DMA_CH2.
 *   @arg  DMA_CH3.
 *   @arg  DMA_CH4.
 *   @arg  DMA_CH5.
 *   @arg  DMA_CH6.
 *   @arg  DMA_CH7.
 * @param  [in] enNewState New state of LLP function.
 * @retval None
 */
void DMA_LlpCmd(M4_DMA_TypeDef *DMAx, uint8_t u8Ch, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_CH(u8Ch));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

