a316363723/pr307-308/PR_307_L3_PR_308_L2_lightbody/APP/driver/src/hc32f4a0_dmaaa.c
    if (Enable == enNewState)
    {
        SET_REG32_BIT(DMA_CH_REG(DMAx->CHCTL0, u8Ch), DMA_CHCTL_LLPEN);
    }
    else
    {
        CLEAR_REG32_BIT(DMA_CH_REG(DMAx->CHCTL0, u8Ch), DMA_CHCTL_LLPEN);
    }
}

/**
 * @brief  DMA reconfig function enable or disable.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  M4_DMA1 Unit1.
 *   @arg  M4_DMA2 Unit2.
 * @param  [in] enNewState New state of reconfig function.
 * @retval None
 */
void DMA_ReConfigCmd(M4_DMA_TypeDef *DMAx, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (Enable == enNewState)
    {
        SET_REG32_BIT(DMAx->RCFGCTL, 1UL);
    }
    else
    {
        CLEAR_REG32_BIT(DMAx->RCFGCTL, 1UL);
    }
}

/**
 * @brief  DMA LLP enable or disable  for reconfig function.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  M4_DMA1 Unit1.
 *   @arg  M4_DMA2 Unit2.
 * @param  [in] u8Ch DMA channel.
 *   @arg  DMA_CH0.
 *   @arg  DMA_CH1.
 *   @arg  DMA_CH2.
 *   @arg  DMA_CH3.
 *   @arg  DMA_CH4.
 *   @arg  DMA_CH5.
 *   @arg  DMA_CH6.
 *   @arg  DMA_CH7.
 * @param  [in] enNewState New state of LLP function in reconfig case.
 * @retval None
 */
void DMA_ReConfigLlpCmd(M4_DMA_TypeDef *DMAx, uint8_t u8Ch, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_CH(u8Ch));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    MODIFY_REG32(DMAx->RCFGCTL, DMA_RCFGCTL_RCFGCHS, ((uint32_t)(u8Ch) << DMA_RCFGCTL_RCFGCHS_POS));
    WRITE_REG32(DMAx->RCFGCTL, enNewState);
}

/**
 * @brief  Initialize DMA re-config mode config structure.
 *          Fill each pstcDmaRCInit with default value
 * @param  [in] pstcDmaRCInit Pointer to a stc_dma_reconfig_init_t structure that
 *                            contains configuration information.
 * @retval Ok: DMA reconfig mode config structure initialize successful
 *         ErrorInvalidParameter: NULL pointer
 */
en_result_t DMA_ReConfigStructInit(stc_dma_reconfig_init_t *pstcDmaRCInit)
{
    en_result_t enRet = Ok;

    if (NULL == pstcDmaRCInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        pstcDmaRCInit->u32CntMode       = DMA_RC_CNT_FIX;
        pstcDmaRCInit->u32DestAddrMode  = DMA_RC_DA_FIX;
        pstcDmaRCInit->u32SrcAddrMode   = DMA_RC_SA_FIX;
    }
    return enRet;
}

/**
 * @brief  DMA reconfig mode initialize.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  M4_DMA1 Unit1.
 *   @arg  M4_DMA2 Unit2.
 * @param  [in] u8Ch DMA channel.
 *   @arg  DMA_CH0.
 *   @arg  DMA_CH1.
 *   @arg  DMA_CH2.
 *   @arg  DMA_CH3.
 *   @arg  DMA_CH4.
 *   @arg  DMA_CH5.
 *   @arg  DMA_CH6.
 *   @arg  DMA_CH7.
 * @param  [in] pstcDmaRCInit DMA reconfig mode config structure
 *   @arg  u32CntMode       DMA reconfig count mode.
 *   @arg  u32DestAddrMode  DMA reconfig destination address mode.
 *   @arg  u32SrcAddrMode   DMA reconfig source address mode.
 * @retval Ok: DMA reconfig function initialize successful
 *         ErrorInvalidParameter: NULL pointer
 */
en_result_t DMA_ReConfigInit(M4_DMA_TypeDef *DMAx, uint8_t u8Ch, const stc_dma_reconfig_init_t *pstcDmaRCInit)
{
    en_result_t enRet = Ok;

    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_CH(u8Ch));

    if (NULL == pstcDmaRCInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        DDL_ASSERT(IS_DMA_RC_CNT_MODE(pstcDmaRCInit->u32CntMode));
        DDL_ASSERT(IS_DMA_RC_DA_MODE(pstcDmaRCInit->u32DestAddrMode));
        DDL_ASSERT(IS_DMA_RC_SA_MODE(pstcDmaRCInit->u32SrcAddrMode));

        MODIFY_REG32(DMAx->RCFGCTL,                                             \
            (DMA_RCFGCTL_RCFGCHS | DMA_RCFGCTL_SARMD | DMA_RCFGCTL_DARMD |      \
            DMA_RCFGCTL_CNTMD),                                                 \
            (pstcDmaRCInit->u32CntMode | pstcDmaRCInit->u32SrcAddrMode |        \
            pstcDmaRCInit->u32DestAddrMode | ((uint32_t)(u8Ch) << DMA_RCFGCTL_RCFGCHS_POS)));
    }
    return enRet;
}

/**
 * @brief  DMA get current source address
 * @param  [in] DMAx DMA unit instance.
 *   @arg  M4_DMA1 Unit1.
 *   @arg  M4_DMA2 Unit2.
 * @param  [in] u8Ch DMA channel.
 *   @arg  DMA_CH0.
 *   @arg  DMA_CH1.
 *   @arg  DMA_CH2.
 *   @arg  DMA_CH3.
 *   @arg  DMA_CH4.
 *   @arg  DMA_CH5.
 *   @arg  DMA_CH6.
 *   @arg  DMA_CH7.
 * @retval Current source address.
 */
uint32_t DMA_GetSrcAddr(const M4_DMA_TypeDef *DMAx, uint8_t u8Ch)
{
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_CH(u8Ch));

    return READ_REG32(DMA_CH_REG(DMAx->MONSAR0, u8Ch));
}

/**
 * @brief  DMA get current destination address
 * @param  [in] DMAx DMA unit instance.
 *   @arg  M4_DMA1 Unit1.
 *   @arg  M4_DMA2 Unit2.
 * @param  [in] u8Ch DMA channel.
 *   @arg  DMA_CH0.
 *   @arg  DMA_CH1.
 *   @arg  DMA_CH2.
 *   @arg  DMA_CH3.
 *   @arg  DMA_CH4.
 *   @arg  DMA_CH5.
 *   @arg  DMA_CH6.
 *   @arg  DMA_CH7.
 * @retval Current destination address.
 */
uint32_t DMA_GetDestAddr(const M4_DMA_TypeDef *DMAx, uint8_t u8Ch)
{
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_CH(u8Ch));

    return READ_REG32(DMA_CH_REG(DMAx->MONDAR0, u8Ch));
}

/**
 * @brief  DMA get current transfer count
 * @param  [in] DMAx DMA unit instance.
 *   @arg  M4_DMA1 Unit1.
 *   @arg  M4_DMA2 Unit2.
 * @param  [in] u8Ch DMA channel.
 *   @arg  DMA_CH0.
 *   @arg  DMA_CH1.
 *   @arg  DMA_CH2.
 *   @arg  DMA_CH3.
 *   @arg  DMA_CH4.
 *   @arg  DMA_CH5.
 *   @arg  DMA_CH6.
 *   @arg  DMA_CH7.
 * @retval Current transfer count.
 */
uint32_t DMA_GetTransCnt(const M4_DMA_TypeDef *DMAx, uint8_t u8Ch)
{
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_CH(u8Ch));

    return ((READ_REG32(DMA_CH_REG(DMAx->MONDTCTL0, u8Ch)) >> DMA_DTCTL_CNT_POS) & 0xFFFFUL);
}

/**
 * @brief  DMA get current block size
 * @param  [in] DMAx DMA unit instance.
 *   @arg  M4_DMA1 Unit1.
 *   @arg  M4_DMA2 Unit2.
 * @param  [in] u8Ch DMA channel.
 *   @arg  DMA_CH0.
 *   @arg  DMA_CH1.
 *   @arg  DMA_CH2.
 *   @arg  DMA_CH3.
 *   @arg  DMA_CH4.
 *   @arg  DMA_CH5.
 *   @arg  DMA_CH6.
 *   @arg  DMA_CH7.
 * @retval Current block size.
 */
uint32_t DMA_GetBlockSize(const M4_DMA_TypeDef *DMAx, uint8_t u8Ch)
{
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_CH(u8Ch));

    return (READ_REG32_BIT(DMA_CH_REG(DMAx->MONDTCTL0, u8Ch), DMA_DTCTL_BLKSIZE));
}

/**
 * @brief  DMA get current source repeat size
 * @param  [in] DMAx DMA unit instance.
 *   @arg  M4_DMA1 Unit1.
 *   @arg  M4_DMA2 Unit2.
 * @param  [in] u8Ch DMA channel.
 *   @arg  DMA_CH0.
 *   @arg  DMA_CH1.
 *   @arg  DMA_CH2.
 *   @arg  DMA_CH3.
 *   @arg  DMA_CH4.
 *   @arg  DMA_CH5.
 *   @arg  DMA_CH6.
 *   @arg  DMA_CH7.
 * @retval Current source repeat size.
 */
uint32_t DMA_GetSrcRptSize(const M4_DMA_TypeDef *DMAx, uint8_t u8Ch)
{
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_CH(u8Ch));

    return (READ_REG32_BIT(DMA_CH_REG(DMAx->MONRPT0, u8Ch), DMA_RPT_SRPT));
}

/**
 * @brief  DMA get current destination repeat size
 * @param  [in] DMAx DMA unit instance.
 *   @arg  M4_DMA1 Unit1.
 *   @arg  M4_DMA2 Unit2.
 * @param  [in] u8Ch DMA channel.
 *   @arg  DMA_CH0.
 *   @arg  DMA_CH1.
 *   @arg  DMA_CH2.
 *   @arg  DMA_CH3.
 *   @arg  DMA_CH4.
 *   @arg  DMA_CH5.
 *   @arg  DMA_CH6.
 *   @arg  DMA_CH7.
 * @retval Current destination repeat size.
 */
uint32_t DMA_GetDestRptSize(const M4_DMA_TypeDef *DMAx, uint8_t u8Ch)
{
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_CH(u8Ch));

